# İleri Seviye Pandas

## İleri Seviye Birleştirme İşlemleri

In [1]:
import pandas as pd
import numpy as np

In [8]:
df1 = pd.DataFrame({'çalışanlar':['ali','veli','ayşe','banu','fatma'],'departman':['muhasebe','mühendis','mühendis','pazarlama','İK']})
df

  çalışanlar  departman
0        ali   muhasebe
1       veli   mühendis
2       ayşe   mühendis
3       banu  pazarlama
4      fatma         İK

In [9]:
df2 = pd.DataFrame({'çalışanlar':['ali','veli','ayşe','banu','fatma'],'yıl':['2016','2015','2016','2014','2015']})
df2

  çalışanlar   yıl
0        ali  2016
1       veli  2015
2       ayşe  2016
3       banu  2014
4      fatma  2015

çalışanlar değerine bakıldığında aldığı değerler birebir aynıdır. **merge** fonksiyonu hangi sütunların aynı olduğunu algılar ve ona göre birleştirme işlemi yapar. Belirtilmesi gerekli olduğu durumlarda **on='birleştirme işlemini şuna göre yap'** argümanı kullanılır.

In [11]:
pd.merge(df1,df2)

  çalışanlar  departman   yıl
0        ali   muhasebe  2016
1       veli   mühendis  2015
2       ayşe   mühendis  2016
3       banu  pazarlama  2014
4      fatma         İK  2015

veritabanı işlemlerinde birden çok birleştirme işlemi vardır. 1-1, 1-n, n-m gibi.

In [12]:
df3 = pd.merge(df1,df2)
df3

  çalışanlar  departman   yıl
0        ali   muhasebe  2016
1       veli   mühendis  2015
2       ayşe   mühendis  2016
3       banu  pazarlama  2014
4      fatma         İK  2015

**n-1 ilişkisi**

In [15]:
df4 = pd.DataFrame({'departman':['muhasebe','mühendis','pazarlama','İK'],'mudur':['ahmet','merve','emine','kaan']})
df4

   departman  mudur
0   muhasebe  ahmet
1   mühendis  merve
2  pazarlama  emine
3         İK   kaan

In [17]:
pd.merge(df3,df4)

  çalışanlar  departman   yıl  mudur
0        ali   muhasebe  2016  ahmet
1       veli   mühendis  2015  merve
2       ayşe   mühendis  2016  merve
3       banu  pazarlama  2014  emine
4      fatma         İK  2015   kaan

**n-m ilişkisi**

In [22]:
df5 = pd.DataFrame({'departman':['muhasebe','muhasebe','pazarlama','mühendis','mühendis','İK','İK'],'yetenekler':['matematik','excel','reklam','kodlama','linux','excel','yönetim']})
df5

   departman yetenekler
0   muhasebe  matematik
1   muhasebe      excel
2  pazarlama     reklam
3   mühendis    kodlama
4   mühendis      linux
5         İK      excel
6         İK    yönetim

In [23]:
pd.merge(df1,df5)

  çalışanlar  departman yetenekler
0        ali   muhasebe  matematik
1        ali   muhasebe      excel
2       veli   mühendis    kodlama
3       veli   mühendis      linux
4       ayşe   mühendis    kodlama
5       ayşe   mühendis      linux
6       banu  pazarlama     reklam
7      fatma         İK      excel
8      fatma         İK    yönetim

In [51]:
import seaborn as sns

In [28]:
df= sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [29]:
df.shape

(1035, 6)

In [30]:
df.count()

method            1035
number            1035
orbital_period     992
mass               513
distance           808
year              1035
dtype: int64

In [31]:
df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [32]:
df['mass'].mean()

2.6381605847953233

In [33]:
df['distance'].count()

808

In [34]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

eksik verileri silerek

In [35]:
df.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

## Gruplama işlemi

Gruplama işlemi veri setindeki kategorik değişkenlerin yakalanması ve bunlar özelinde işlemler yapılmasıdır.

In [6]:
df = pd.DataFrame({'grup':['A','B','C','A','B','C'],'veri':[10,11,52,23,43,55]})
df.T

       0   1   2   3   4   5
grup   A   B   C   A   B   C
veri  10  11  52  23  43  55

In [7]:
df.groupby('grup')

In [9]:
df.groupby('grup').mean().T

grup     A     B     C
veri  16.5  27.0  53.5

df.groupby('neye göre grupla')['değişkenken'].ne_işlem_yapılması_isteniyorsa()

## İleri Toplulaştırma İşlemleri (Aggregate,filter,transform,apply)

In [22]:
df = pd.DataFrame({'grup':['A','B','C','A','B','C'],
                   'değisken1':[10,23,33,22,11,99],
                   'değisken2':[100,253,333,262,111,969]},
                    )
df

  grup  değisken1  değisken2
0    A         10        100
1    B         23        253
2    C         33        333
3    A         22        262
4    B         11        111
5    C         99        969

### aggregate

In [23]:
df.groupby('grup').mean()

      değisken1  değisken2
grup
A            16        181
B            17        182
C            66        651

In [24]:
df.groupby('grup').aggregate(["min",np.median,max])

     değisken1            değisken2
           min median max       min median  max
grup
A           10     16  22       100    181  262
B           11     17  23       111    182  253
C           33     66  99       333    651  969

pandas min ve max değerlerini tırnakla algılayabiliyorken, median işlemi için np.median yazılması gerekiyor.

## filter

Daha önce koşul ifadeleri ile filtreleme yapılmıştı. Ama bazen öyle bir ihtiyaç duyulur ki kendi kişisel fonskyonları filtreleme işlemi olarak kullnamak isteyebiliriz.

In [25]:
def filter_func(x):
    return x['degisken1'].std()>9

In [28]:
df.groupby('grup').filter(filter_func)

TypeError: filter_func() got an unexpected keyword argument 'axis'

### transform

In [36]:
df["degisken1"]*9

KeyError: 'degisken1'

In [32]:
df.columns

Index(['grup', 'değisken1', 'değisken2'], dtype='object')

In [42]:
df_a =df.iloc[:,1:3]
df_a

   değisken1  değisken2
0         10        100
1         23        253
2         33        333
3         22        262
4         11        111
5         99        969

In [44]:
df_a.transform(lambda x: (x-x.mean())/ x.std())

   değisken1  değisken2
0  -0.687871  -0.738461
1  -0.299074  -0.263736
2   0.000000  -0.015514
3  -0.328982  -0.235811
4  -0.657963  -0.704331
5   1.973890   1.957853

### apply

In [45]:
df_a

   değisken1  değisken2
0         10        100
1         23        253
2         33        333
3         22        262
4         11        111
5         99        969

DataFrame değişkenleri üzerinde gezinen ve aggregation işlemi yapabilen bir fonksiyondur

In [48]:
df_a.apply(np.sum)

değisken1     198
değisken2    2028
dtype: int64

df.groupby('grup').apply(np.sum)

### Pivot Tablolar

In [52]:
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

Cinsiyetlere göre gruplayıp survived değişkenini inceleme

In [54]:
titanic.groupby('sex')["survived"].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [57]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

unstack() --- hiyerarşk index yapısına göre

pivot ile pivot table

In [58]:
titanic.pivot_table("survived",index="sex",columns="class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

Yukarıdaki iki işlemde birbirinin aynısı

Çok boyutlu bir pivot

In [59]:
titanic.age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

Bu sürekli değişkeni kategorik değişkene çevirip, sınıflarını da pivot olarak boyut olarak ekleme

In [61]:
age = pd.cut(titanic['age'],[0,18,90])
age.head(10)

0    (18.0, 90.0]
1    (18.0, 90.0]
2    (18.0, 90.0]
3    (18.0, 90.0]
4    (18.0, 90.0]
5             NaN
6    (18.0, 90.0]
7     (0.0, 18.0]
8    (18.0, 90.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (2, interval[int64]): [(0, 18] < (18, 90]]

In [62]:
titanic.pivot_table("survived",["sex",age],"class")

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663